missão-3/_TESTE_FUNCIONAL_10032025-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario:  TESTE FUNCIONAL 10032025-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario:  TESTE FUNCIONAL 10032025-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
   TESTE FUNCIONAL 10032025-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1440,765)
      - go(https://blazedemo.com/index.php)
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)
      - waitForCSS(input.btn.btn-small): "Clickable"
      - clickByCSS(input.btn.btn-small)
      - waitForID(inputName): "Clickable"
      - clickByID(inputName)
      - waitForID(inputName): "Clickable"
      - typeByID(inputName): "<>FEAF!@#$"
      - waitForID(address): "Clickable"
      - clickByID(address)
      - waitForID(address): "Clickable"
      - typeByID(address): "{{}:::/*-+."
      - waitForID(city): "Clickable"
      - clickByID(city)
      - waitForID(city): "Clickable"
      - typeByID(city): "<>FEAF!@#$"
      - waitForID(state): "Clickable"
      - clickByID(state)
      - waitForID(state): "Clickable"
      - typeByID(state): "<>FEAF!@#$"
      - waitForID(zipCode): "Clickable"
      - clickByID(zipCode)
      - waitForID(zipCode): "Clickable"
      - typeByID(zipCode): "<>FEAF!@#$"
      - 'waitForCSS(div:nth-of-type(6) > .controls)': "Clickable"
      - 'clickByCSS(div:nth-of-type(6) > .controls)'
      - waitForID(creditCardNumber): "Clickable"
      - clickByID(creditCardNumber)
      - waitForID(cardType): "Clickable"
      - clickByID(cardType)
      - waitForID(cardType): "Clickable"
      - selectByID(cardType): "American Express"
      - waitForID(creditCardNumber): "Clickable"
      - clickByID(creditCardNumber)
      - waitForID(creditCardNumber): "Clickable"
      - typeByID(creditCardNumber): "1234567iu8op"
      - waitForID(creditCardMonth): "Clickable"
      - clickByID(creditCardMonth)
      - 'waitForCSS(div:nth-of-type(9) > .controls)': "Clickable"
      - 'clickByCSS(div:nth-of-type(9) > .controls)'
      - waitForID(nameOnCard): "Clickable"
      - clickByID(nameOnCard)
      - waitForID(nameOnCard): "Clickable"
      - typeByID(nameOnCard): "<>FEAF!@#$"
      - waitForCSS(label.checkbox): "Clickable"
      - clickByCSS(label.checkbox)
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)

   TESTE FUNCIONAL 10032025-Http:
    headers:
      sec-ch-ua: '"Chromium";v="134", "Not:A-Brand";v="24", "Google Chrome";v="134"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Content-Type: application/x-www-form-urlencoded
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/134.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      sec-ch-ua-arch: '"x86"'
      sec-ch-ua-platform-version: '"19.0.0"'
      sec-ch-ua-model: '""'
      sec-ch-ua-bitness: '"64"'
      sec-ch-ua-wow64: '?0'
      sec-ch-ua-full-version-list: >-
        "Chromium";v="134.0.6998.36", "Not:A-Brand";v="24.0.0.0", "Google
        Chrome";v="134.0.6998.36"
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/reserve.php
            method: POST
            label: https://blazedemo.com/reserve.php
            think-time: 0ms
            headers: {}
            body:
              fromPort: Paris
              toPort: Buenos Aires
          - url: https://blazedemo.com/purchase.php
            method: POST
            label: https://blazedemo.com/purchase.php
            think-time: 1911ms
            headers: {}
            body:
              airline: Virgin America
              flight: '43'
              fromPort: Paris
              price: '472.56'
              toPort: Buenos Aires
          - url: https://blazedemo.com/confirmation.php
            method: POST
            label: https://blazedemo.com/confirmation.php
            think-time: 16103ms
            headers: {}
            body:
              _token: ''
              address: '{{}:::/*-+.'
              cardType: amex
              city: <>FEAF!@#$
              creditCardMonth: '11'
              creditCardNumber: 1234567iu8op
              creditCardYear: '2017'
              inputName: <>FEAF!@#$
              nameOnCard: <>FEAF!@#$
              rememberMe: 'on'
              state: <>FEAF!@#$
              zipCode: <>FEAF!@#$